Revit 2027 API
ParameterTypeId.RebarMaxLength Property
 "Maximum Bar Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarMaxLength { get; }
Public Shared ReadOnly Property RebarMaxLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarMaxLength {
	ForgeTypeId^ get ();
}
static member RebarMaxLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace